# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

numbers = [4, 6, -10, 1, 2, -5]
sum=0
for num in numbers:
    sum += num
print(sum)
