# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
names_string = ', '.join(names)

print (names_string)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
